#  Задача №2
# Написать точно такую же процедуру, но в декларативном стиле

init_list = [1, 2, 6, 3, 8, 4, 2, 1]
init_list.sort(reverse=True)
print(init_list)
